const productInfo = {
    chatsargana: {
        name: "ЧАЦАРГАНЫ ДАРС",
        image: "/images/dars2.png",
        description: "Монгол орны хөрсөнд ургасан жимсний хаан чацарганыг исгэж дарж 1967 оноос хойш үйлдвэрлэсэн анхны дарс, экологийн цэвэр бүтээгдэхүүн. Анх 1967 онд тухайн үеийн дарс болон исгэлтийн чиглэлээр мэргэшсэн Чехслоловак улсын хоёр эрдэмтэн Говь-Алтай аймгийн Бигэр суманд тус сумын ойр орчимд ургадаг жимс жимсгэнэ, тэр дундаа хармаг жимсээр дарс хийж болох юм байна гэх санаан дээр суурилж үйлдвэрийг 10 орчим ажилчидтайгаар байгуулсан юм. Тус үйлдвэр Монгол улсад анх удаа орон нутагт төрөл бүрийн дарс үйлвэрлэж мөн чацарганы тос болон виски, коньяк зэргийг үйлдвэрлэж ирсэн. Тус үйлдвэрийн үйлдвэрлэсэн чацарганы тос 1981 онд ЗХУ Монгол улсын сансарын хамтарсан нислэгийн хүнсээр шалгарч явсан. ",
        benefitsTitle: "ЧАЦАРГАНЫ АШИГ ТУС",
        bannerImage: "/images/ch-wine.jpg",
        benefits: "Уг жимс нь маш бага хэмжээний нягтралтай уураг агуулдаг бөгөөд энэ нь артерийн судасны хана гэмтэхээс хамгаалдаг. Мөн ханиадыг зогсоох, цусыг шингэрүүлэх зүрх судасны системийн эргэлтийг сайжруулахад нэн ач тустай.",
        benefitsImage: "/images/seabuckthorne.png",
    },
    kharmag: {
        name: "ХАРМАГИЙН ДАРС",
        image: "/images/dars1.png",
        description: "Монгол орны хөрсөнд зэрлэгээр ургасан хармаг жимсийг исгэж дарж үйлдвэрлэсэн хагас хуурай, хуурай төрлийн дарс. Анх 1967 онд тухайн үеийн дарс болон исгэлтийн чиглэлээр мэргэшсэн Чехслоловак улсын хоёр эрдэмтэн Говь-Алтай аймгийн Бигэр суманд тус сумын ойр орчимд ургадаг жимс жимсгэнэ, тэр дундаа хармаг жимсээр дарс хийж болох юм байна гэх санаан дээр суурилж үйлдвэрийг 10 орчим ажилчидтайгаар байгуулсан юм. Тус үйлдвэр Монгол улсад анх удаа орон нутагт төрөл бүрийн дарс үйлвэрлэж мөн чацарганы тос болон виски, коньяк зэргийг үйлдвэрлэж ирсэн. Тус үйлдвэрийн үйлдвэрлэсэн чацарганы тос 1981 онд ЗХУ Монгол улсын сансарын хамтарсан нислэгийн хүнсээр шалгарч явсан. ",
        benefitsTitle: "ХАРМАГИЙН АШИГ ТУС",
        bannerImage: "/images/wine-banner.png",
        benefits: "Уг жимс нь маш бага хэмжээний нягтралтай уураг агуулдаг бөгөөд энэ нь артерийн судасны хана гэмтэхээс хамгаалдаг. Мөн ханиадыг зогсоох, цусыг шингэрүүлэх зүрх судасны системийн эргэлтийг сайжруулахад нэн ач тустай.",
        benefitsImage: "/images/harmag.jpg"
    },
    ners: {
        name: "НЭРСНИЙ ДАРС",
        image: "/images/dars3.png",
        description: "Монгол орны хөрсөнд зэрлэгээр ургасан аньс, нэрс жимсийг исгэж дарж 1967 оноос хойш үйлдвэрлэсэн анхны вино, экологийн цэвэр бүтээгдэхүүн. Анх 1967 онд тухайн үеийн дарс болон исгэлтийн чиглэлээр мэргэшсэн Чехслоловак улсын хоёр эрдэмтэн Говь-Алтай аймгийн Бигэр суманд тус сумын ойр орчимд ургадаг жимс жимсгэнэ, тэр дундаа хармаг жимсээр дарс хийж болох юм байна гэх санаан дээр суурилж үйлдвэрийг 10 орчим ажилчидтайгаар байгуулсан юм. Тус үйлдвэр Монгол улсад анх удаа орон нутагт төрөл бүрийн дарс үйлвэрлэж мөн чацарганы тос болон виски, коньяк зэргийг үйлдвэрлэж ирсэн. Тус үйлдвэрийн үйлдвэрлэсэн чацарганы тос 1981 онд ЗХУ Монгол улсын сансарын хамтарсан нислэгийн хүнсээр шалгарч явсан. ",
        benefitsTitle: "НЭРСНИЙ АШИГ ТУС",
        bannerImage: "/images/ners-banner.png",
        benefits: "Уг жимс нь маш бага хэмжээний нягтралтай уураг агуулдаг бөгөөд энэ нь артерийн судасны хана гэмтэхээс хамгаалдаг. Мөн ханиадыг зогсоох, цусыг шингэрүүлэх зүрх судасны системийн эргэлтийг сайжруулахад нэн ач тустай.",
        benefitsImage: "/images/blueberry.png"
    },
    whisky: {
        name: "GOBI ALTAI ВИСКИ",
        image: "/images/whisky2.png",
        description: "Ирланд технологиор Монгол улсад 1967 оноос хойш анх удаа үйлдвэрлэсэн бүтээгдэхүүн.Анх 1967 онд тухайн үеийн дарс болон исгэлтийн чиглэлээр мэргэшсэн Чехслоловак улсын хоёр эрдэмтэн Говь-Алтай аймгийн Бигэр суманд тус сумын ойр орчимд ургадаг жимс жимсгэнэ, тэр дундаа хармаг жимсээр дарс хийж болох юм байна гэх санаан дээр суурилж үйлдвэрийг 10 орчим ажилчидтайгаар байгуулсан юм. Тус үйлдвэр Монгол улсад анх удаа орон нутагт төрөл бүрийн дарс үйлвэрлэж мөн чацарганы тос болон виски, коньяк зэргийг үйлдвэрлэж ирсэн. Тус үйлдвэрийн үйлдвэрлэсэн чацарганы тос 1981 онд ЗХУ Монгол улсын сансарын хамтарсан нислэгийн хүнсээр шалгарч явсан. ",
        benefitsTitle: "ВИСКИ АШИГ ТУС",
        bannerImage: "/images/whiskey-banner.png",
        benefits: "Виски нь исгэсэн үр тариагаар хийсэн алкохолны төрөл юм. Төрөл бүрийн үр тариа, арвай, эрдэнэ шиш, хөх тариа, улаан буудай зэрэг янз бүрийн сортууд ашиглагддаг. Вискиг ихэвчлэн шатсан цагаан царс модоор хийгдсэн модон торхонд дарж хадгалдаг.",
        benefitsImage: "/images/whisky3.jpg"
    },
    champagne: {
        name: "МОНГОЛ ОРГИЛУУН ДАРС",
        image: "/images/champagne.png",
        description: "Монгол орны хөрсөнд ургасан жимсний хаан чацарганыг исгэж шимийн архитай хослуулан дарж гаргасан оргилуун дарс, экологийн цэвэр бүтээгдэхүүн. Анх 1967 онд тухайн үеийн дарс болон исгэлтийн чиглэлээр мэргэшсэн Чехслоловак улсын хоёр эрдэмтэн Говь-Алтай аймгийн Бигэр суманд тус сумын ойр орчимд ургадаг жимс жимсгэнэ, тэр дундаа хармаг жимсээр дарс хийж болох юм байна гэх санаан дээр суурилж үйлдвэрийг 10 орчим ажилчидтайгаар байгуулсан юм. Тус үйлдвэр Монгол улсад анх удаа орон нутагт төрөл бүрийн дарс үйлвэрлэж мөн чацарганы тос болон виски, коньяк зэргийг үйлдвэрлэж ирсэн. Тус үйлдвэрийн үйлдвэрлэсэн чацарганы тос 1981 онд ЗХУ Монгол улсын сансарын хамтарсан нислэгийн хүнсээр шалгарч явсан. ",
        benefitsTitle: "ШАМПАНЬНЫ АШИГ ТУС",
        bannerImage: "/images/ch-wine.jpg",
        benefits: "Шампанийн дарс нь маш бага калори агуулдаг бөгөөд нүдний эрүүл мэнд, арьсны чийгшил, цусны эргэлт сайжруулахад ашигтай. Мөн хэт их хооллолтын дараа шингэн тэнцвэрийг хадгалахад тусална.",
        benefitsImage: "/images/harmag.jpg",
    },
    champagneKharmag: {
        name: "ХАРМАГЫН ДАРС",
        image: "/images/champagne-second.png",
        description: "Монгол орны хөрсөнд ургасан жимсний хаан чацарганыг исгэж шимийн архитай хослуулан дарж гаргасан оргилуун дарс, экологийн цэвэр бүтээгдэхүүн. Анх 1967 онд тухайн үеийн дарс болон исгэлтийн чиглэлээр мэргэшсэн Чехслоловак улсын хоёр эрдэмтэн Говь-Алтай аймгийн Бигэр суманд тус сумын ойр орчимд ургадаг жимс жимсгэнэ, тэр дундаа хармаг жимсээр дарс хийж болох юм байна гэх санаан дээр суурилж үйлдвэрийг 10 орчим ажилчидтайгаар байгуулсан юм. Тус үйлдвэр Монгол улсад анх удаа орон нутагт төрөл бүрийн дарс үйлвэрлэж мөн чацарганы тос болон виски, коньяк зэргийг үйлдвэрлэж ирсэн. Тус үйлдвэрийн үйлдвэрлэсэн чацарганы тос 1981 онд ЗХУ Монгол улсын сансарын хамтарсан нислэгийн хүнсээр шалгарч явсан. ",
        benefitsTitle: "ШАМПАНЬНЫ АШИГ ТУС",
        bannerImage: "/images/ch-wine.jpg",
        benefits: "Шампанийн дарс нь маш бага калори агуулдаг бөгөөд нүдний эрүүл мэнд, арьсны чийгшил, цусны эргэлт сайжруулахад ашигтай. Мөн хэт их хооллолтын дараа шингэн тэнцвэрийг хадгалахад тусална.",
        benefitsImage: "/images/harmag.jpg",
    }
};

const urlParams = new URLSearchParams(window.location.search);
const product = urlParams.get("product") || "chatsargana"; 

document.addEventListener("DOMContentLoaded", function () {
    document.getElementById("product-name").innerText = productInfo[product].name;
    document.getElementById("product-image").src = productInfo[product].image;
    document.getElementById("product-description").innerText = productInfo[product].description;
    document.getElementById("product-benefits-title").innerText = productInfo[product].benefitsTitle;
    document.getElementById("banner-image").src = productInfo[product].bannerImage;
    document.getElementById("ben-image").src = productInfo[product].benefitsImage;
    document.getElementById("product-benefits").innerText = productInfo[product].benefits;
});
